CSI API ETABS v1
cPropFrame.SetISection_1 Method
 Initializes an I-type frame section property. If this function is called for an existing frame section property, all items for the section are reset to their default value.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetISection_1(
	string Name,
	string MatProp,
	double T3,
	double T2,
	double Tf,
	double Tw,
	double T2b,
	double Tfb,
	double FilletRadius,
	int Color = -1,
	string Notes = "",
	string GUID = ""
)
Function SetISection_1 (
	Name As String,
	MatProp As String,
	T3 As Double,
	T2 As Double,
	Tf As Double,
	Tw As Double,
	T2b As Double,
	Tfb As Double,
	FilletRadius As Double,
	Optional Color As Integer = -1,
	Optional Notes As String = "",
	Optional GUID As String = ""
) As Integer
Dim instance As cPropFrame
Dim Name As String
Dim MatProp As String
Dim T3 As Double
Dim T2 As Double
Dim Tf As Double
Dim Tw As Double
Dim T2b As Double
Dim Tfb As Double
Dim FilletRadius As Double
Dim Color As Integer
Dim Notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.SetISection_1(Name,
	MatProp, T3, T2, Tf, Tw, T2b, Tfb, FilletRadius,
	Color, Notes, GUID)
int SetISection_1(
	String^ Name,
	String^ MatProp,
	double T3,
	double T2,
	double Tf,
	double Tw,
	double T2b,
	double Tfb,
	double FilletRadius,
	int Color = -1,
	String^ Notes = L"",
	String^ GUID = L""
)
abstract SetISection_1 :
        Name : string *
        MatProp : string *
        T3 : float *
        T2 : float *
        Tf : float *
        Tw : float *
        T2b : float *
        Tfb : float *
        FilletRadius : float *
        ?Color : int *
        ?Notes : string *
        ?GUID : string
(* Defaults:
        let _Color = defaultArg Color -1
        let _Notes = defaultArg Notes ""
        let _GUID = defaultArg GUID ""
*)
-> int
Parameters
Name
Type: System.String
The name of an existing or new frame section property. If this is an existing property, that property is modified; otherwise, a new property is added.
MatProp
Type: System.String
The name of the material property for the section.
T3
Type: System.Double
The section depth. [L]
T2
Type: System.Double
The top flange width. [L]
Tf
Type: System.Double
The top flange thickness. [L]
Tw
Type: System.Double
The web thickness. [L]
T2b
Type: System.Double
The bottom flange width. [L]
Tfb
Type: System.Double
The bottom flange thickness. [L]
FilletRadius
Type: System.Double
The fillet radius. [L]
Color (Optional)
Type: System.Int32
The display color assigned to the section. If Color is specified as -1, the program will automatically assign a color.
Notes (Optional)
Type: System.String
The notes, if any, assigned to the section.
GUID (Optional)
Type: System.String
The GUID (global unique identifier), if any, assigned to the section. If this item is input as Default, the program assigns a GUID to the section.
Return Value
Type: Int32
Returns zero if the section property is successfully initialized; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'set new frame section property
       ret = SapModel.PropFrame.SetISection_1("ISEC1", "A992Fy50", 8, 6, 0.5, 0.5, 4, 0.4, 0.24)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropFrame Interface
ETABSv1 Namespace